#Область СлужебныеПроцедурыИФункции
Процедура СформироватьАктыНаСервере(Параметры, АдресРезультата) Экспорт
	
Запрос = Новый Запрос;
Запрос.Текст =
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
	|	ДоговорыКонтрагентов.Владелец,
	|	ДоговорыКонтрагентов.Организация
	|ПОМЕСТИТЬ вт_ДействующиеДоговора
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.ВКМ_НачалоДействияДоговора <= &ДатаДокумента
	|	И ДоговорыКонтрагентов.ВКМ_ОкончаниеДействияДоговора >= &ДатаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_ДействующиеДоговора.Ссылка КАК Договор,
	|	ВКМ_ВыполненныеКлиентуРаботыОбороты.Контрагент КАК Контрагент,
	|	ВКМ_ВыполненныеКлиентуРаботыОбороты.КоличествоЧасовОборот КАК КоличествоЧасовОборот,
	|	ВКМ_ВыполненныеКлиентуРаботыОбороты.СуммаКОплатеОборот КАК СуммаКОплатеОборот,
	|	ОбработкаЗаказовОбороты.СуммаОтгрузкиОборот КАК СуммаОтгрузкиОборот,
	|	вт_ДействующиеДоговора.Владелец,
	|	вт_ДействующиеДоговора.Организация
	|ИЗ
	|	вт_ДействующиеДоговора КАК вт_ДействующиеДоговора
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.Обороты(&НачалоМесяца, &КонецМесяца,,) КАК
	|			ВКМ_ВыполненныеКлиентуРаботыОбороты
	|		ПО вт_ДействующиеДоговора.Ссылка = ВКМ_ВыполненныеКлиентуРаботыОбороты.ДоговорКонтрагента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОбработкаЗаказов.Обороты(&НачалоМесяца, &КонецМесяца,,) КАК
	|			ОбработкаЗаказовОбороты
	|		ПО вт_ДействующиеДоговора.Ссылка = ОбработкаЗаказовОбороты.Договор";


	Запрос.УстановитьПараметр("ДатаДокумента", Параметры.ДатаДокумента);
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(Параметры.ДатаДокумента));
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(Параметры.ДатаДокумента));

РезультатЗапроса = Запрос.Выполнить();

ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СуммаОтгрузкиОборот) Тогда
		ОбъектРеализации = Документы.РеализацияТоваровУслуг.СоздатьДокумент();	
//		ОбъектРеализации.Дата = Параметры.ДатаДокумента;
//		ОбъектРеализации.Контрагент = ВыборкаДетальныеЗаписи.Владелец;
//		ОбъектРеализации.Организация = ВыборкаДетальныеЗаписи.Организация;
//		ОбъектРеализации.Договор = ВыборкаДетальныеЗаписи.Договор;
//		ОбъектРеализации.Основание = ВыборкаДетальныеЗаписи.Договор;
//		ОбъектРеализации.Ответственный = Пользователи.ТекущийПользователь();
		СтруктураОбъекта = Новый Структура("Дата, Контрагент, Организация, Договор, Основание", 
					Параметры.ДатаДокумента, ВыборкаДетальныеЗаписи.Владелец, ВыборкаДетальныеЗаписи.Организация, ВыборкаДетальныеЗаписи.Договор,
						ВыборкаДетальныеЗаписи.Договор);
		ОбъектРеализации.Заполнить(СтруктураОбъекта);
		ОбъектРеализации.ВыполнитьАвтозаполнение(Параметры.ДатаДокумента, ВыборкаДетальныеЗаписи.Договор, ОбъектРеализации);
	
	КонецЕсли;
КонецЦикла;


КонецПроцедуры
#КонецОбласти