Процедура СформироватьАктыНаСервере(Параметры, АдресРезультата) Экспорт
	

Запрос = Новый Запрос;
Запрос.Текст =
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Договор,
	|	РеализацияТоваровУслуг.Ссылка КАК Реализация,
	|	ВыполненныеКлиентуРаботыОбороты.СуммаКОплатеОборот КАК СуммаКОплате,
	|	ВыполненныеКлиентуРаботыОбороты.КоличествоЧасовОборот КАК КоличествоЧасов,
	|	ДоговорыКонтрагентов.Владелец,
	|	ДоговорыКонтрагентов.Организация
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ДоговорыКонтрагентов.Ссылка = РеализацияТоваровУслуг.Договор
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыполненныеКлиентуРаботы.Обороты(&НачалоМесяца, &КонецМесяца,,) КАК
	|			ВыполненныеКлиентуРаботыОбороты
	|		ПО ДоговорыКонтрагентов.Ссылка = ВыполненныеКлиентуРаботыОбороты.ДоговорКонтрагента.Ссылка
	|ГДЕ
	|	ДоговорыКонтрагентов.ВКМ_НачалоДействияДоговора <= &ТекущаяДата
	|	И ДоговорыКонтрагентов.ВКМ_ОкончаниеДействияДоговора >= &ТекущаяДата";

Запрос.УстановитьПараметр("ТекущаяДата", Параметры.ДатаДокумента);
Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(Параметры.ДатаДокумента));
Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(Параметры.ДатаДокумента));

РезультатЗапроса = Запрос.Выполнить();

ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Если ВыборкаДетальныеЗаписи.Реализация = NULL И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СуммаКОплате) Тогда
		ОбъектРеализации = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		ОбъектРеализации.Дата = Параметры.ДатаДокумента;
		ОбъектРеализации.Контрагент = ВыборкаДетальныеЗаписи.Владелец;
		ОбъектРеализации.Организация = ВыборкаДетальныеЗаписи.Организация;
		ОбъектРеализации.Договор = ВыборкаДетальныеЗаписи.Договор;
		ОбъектРеализации.Основание = ВыборкаДетальныеЗаписи.Договор;
		ОбъектРеализации.Ответственный = Пользователи.ТекущийПользователь();
		ОбъектРеализации.ВыполнитьАвтозаполнение(Параметры.ДатаДокумента, ВыборкаДетальныеЗаписи.Договор, ОбъектРеализации);
	
	КонецЕсли;
КонецЦикла;


КонецПроцедуры