#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.СохрПер = Истина;
	Иначе
		Объект.СохрПер = Ложь;
	КонецЕсли;	
	
КонецПроцедуры


&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Объект.СохрПер Тогда
				
		ЗаписатьУведомлениеТелеграмБоту();
		
	КонецЕсли;	 	
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПроведенияРаботПриИзменении(Элемент)
	
		ЗаписатьУведомлениеТелеграмБоту();
		
КонецПроцедуры

&НаКлиенте
Процедура ВремяНачалаРаботПриИзменении(Элемент)
		
		ЗаписатьУведомлениеТелеграмБоту();
		
КонецПроцедуры

&НаКлиенте
Процедура СпециалистПриИзменении(Элемент)
	
	ЗаписатьУведомлениеТелеграмБоту();
	
КонецПроцедуры

#КонецОбласти



#Область ОбработчикиКомандФормы
// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьУведомлениеТелеграмБоту()
	
	ТекстовоеСообщение = СтрШаблон("Дата посещения: %1
		|Время: %2
		|Сотрудник: %3", Формат(Объект.ДатаПроведенияРабот, "ДФ=dd.MM.yyyy;"), Формат(Объект.ВремяНачалаРабот,"ДЛФ=T"), Объект.Специалист);
		
	
	ОбъектУведомлениеБоту = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
	ОбъектУведомлениеБоту.ТекстСообщения = ТекстовоеСообщение;
	ОбъектУведомлениеБоту.Записать();

КонецПроцедуры


#КонецОбласти