
#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗаписатьУведомлениеТелеграмБоту();
		Возврат;
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.Дата,
		|	ВКМ_ОбслуживаниеКлиента.Специалист
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";

		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);

		РезультатЗапроса = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ВыборкаДетальныеЗаписи.Дата <> Объект.Дата Тогда
				ЗаписатьУведомлениеТелеграмБоту();
				Прервать;
			ИначеЕсли ВыборкаДетальныеЗаписи.Специалист <> Объект.Специалист Тогда
				ЗаписатьУведомлениеТелеграмБоту();
				Прервать;
			КонецЕсли;
		КонецЦикла;

КонецПроцедуры

#КонецОбласти





#Область ОбработчикиКомандФормы
// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьУведомлениеТелеграмБоту()
	
	ТекстовоеСообщение = СтрШаблон("Дата посещения: %1
		|Номер: %4
		|Время: %2
		|Сотрудник: %3", Формат(Объект.ДатаПроведенияРабот, "ДФ=dd.MM.yyyy;"), Формат(Объект.ВремяНачалаРабот,"ДЛФ=T"), Объект.Специалист, Объект.Номер);
		
	
	ОбъектУведомлениеБоту = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
	ОбъектУведомлениеБоту.ТекстСообщения = ТекстовоеСообщение;
	ОбъектУведомлениеБоту.Записать();

КонецПроцедуры

#КонецОбласти