
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КоличествоДнейОтпуска = Новый Соответствие();

	
	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
		ИДСотрудника = Строка.Сотрудник.УникальныйИдентификатор();
		Если ЗначениеЗаполнено(КоличествоДнейОтпуска.Получить(ИДСотрудника)) Тогда
			СтрокаРазницаДат = Строка.ДатаОкончания - Строка.ДатаНачала;
			РазницаДатСотрудника = КоличествоДнейОтпуска[ИДСотрудника];
			Строка.РазницаДат = СтрокаРазницаДат + РазницаДатСотрудника;
			КоличествоДнейОтпуска[ИДСотрудника] = Строка.РазницаДат;
		Иначе		
			Строка.РазницаДат = Строка.ДатаОкончания - Строка.ДатаНачала;
			КоличествоДнейОтпуска.Вставить(ИДСотрудника, Строка.РазницаДат);
		КонецЕсли;	
	КонецЦикла;	

      МассивИменКолонокДляПодсветки = Новый Массив;
    Для Каждого Стр Из Элементы.ОтпускаСотрудников.ПодчиненныеЭлементы Цикл
        МассивИменКолонокДляПодсветки.Добавить(Стр.Имя);
    КонецЦикла;

    
    ЭлементОформления = УсловноеОформление.Элементы.Добавить();
    ЭлементОформления.Использование = Истина;
    ЭлементОформления .Оформление.УстановитьЗначениеПараметра("ЦветФона",WebЦвета.Аквамарин);

    ЭлементУсловия = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ОтпускаСотрудников.РазницаДат");
    ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
    ЭлементУсловия.ПравоеЗначение = 2419200;
    ЭлементУсловия.Использование  = Истина;


	Для Каждого ТекЭлемент Из МассивИменКолонокДляПодсветки Цикл
        ОформляемоеПоле      = ЭлементОформления.Поля.Элементы.Добавить();
        ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ТекЭлемент);
    КонецЦикла;

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ОткрытьДГ(Команда)
	
	Адрес = ПолучитьВременноеХранилище();
	ПараметрыФормы = Новый Структура("АдресВХОтпусткаСотрудников, ДатаДокумента", Адрес, Объект.Год);

	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.ДиаграммаГанта", ПараметрыФормы);
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Функция ПолучитьВременноеХранилище()
	Адрес = ПоместитьВоВременноеХранилище(Объект.ОтпускаСотрудников.Выгрузить());
	Возврат Адрес
КонецФункции
#КонецОбласти


