#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	
	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
	Движения.ВКМ_Удержания.Записывать = Истина;
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	НДФЛ = Константы.ВКМ_ПроцентНДФЛ.Получить();
	
	// регистр ВКМ_ДополнительныеНачисления
	Для Каждого ТекСтрокаПремии Из Премии Цикл
		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ТекСтрокаПремии.ВидРасчета;
		Движение.ПериодРегистрации = ТекСтрокаПремии.ДатаПремии;
		Движение.БазовыйПериодНачало = НачалоМесяца(ТекСтрокаПремии.ДатаПремии);
		Движение.БазовыйПериодКонец = КонецМесяца(ТекСтрокаПремии.ДатаПремии);
		Движение.Сотрудник = ТекСтрокаПремии.Сотрудник;
		Движение.Результат = ТекСтрокаПремии.Премия;
	//КонецЦикла;

	// регистр ВКМ_Удержания
		Движение = Движения.ВКМ_Удержания.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		Движение.ПериодРегистрации = ТекСтрокаПремии.ДатаПремии;
		Движение.ПериодДействияНачало = НачалоМесяца(ТекСтрокаПремии.ДатаПремии);
		Движение.ПериодДействияКонец = КонецМесяца(ТекСтрокаПремии.ДатаПремии);
		Движение.Сотрудник = ТекСтрокаПремии.Сотрудник;
		Движение.Результат = ТекСтрокаПремии.Премия * (НДФЛ / 100);
	//КонецЦикла;
	
	// регистр ВКМ_ВзаиморасчетыССотрудниками
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Сотрудник = ТекСтрокаПремии.Сотрудник;
		Движение.Сумма = ТекСтрокаПремии.Премия;

		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Сотрудник = ТекСтрокаПремии.Сотрудник;
		Движение.Сумма = ТекСтрокаПремии.Премия * (НДФЛ / 100);

	КонецЦикла;
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!


	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ


КонецПроцедуры

#КонецОбласти
