#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)


	// регистр ВКМ_ДополнительныеНачисления
	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
	Для Каждого ТекСтрокаПремии из Премии Цикл
		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ТекСтрокаПремии.ВидРасчета;
		Движение.ПериодРегистрации = ТекСтрокаПремии.ДатаПремии;
		Движение.Сотрудник = ТекСтрокаПремии.Сотрудник;
		Движение.Результат = ТекСтрокаПремии.Премия;
	КонецЦикла;


КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти