#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	
	// регистр ВКМ_ДополнительныеНачисления
	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
	Для Каждого ТекСтрокаПремии из Премии Цикл
		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ТекСтрокаПремии.ВидРасчета;
		Движение.ПериодРегистрации = ТекСтрокаПремии.ДатаПремии;
		Движение.Сотрудник = ТекСтрокаПремии.Сотрудник;
		Движение.Результат = ТекСтрокаПремии.Премия;
	КонецЦикла;

	НДФЛ = Константы.ВКМ_ПроцентНДФЛ.Получить();
	// регистр ВКМ_Удержания
	Движения.ВКМ_Удержания.Записывать = Истина;
	Для Каждого ТекСтрокаПремии из Премии Цикл
		Движение = Движения.ВКМ_Удержания.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		Движение.ПериодРегистрации = ТекСтрокаПремии.ДатаПремии;
		Движение.Сотрудник = ТекСтрокаПремии.Сотрудник;
		Движение.Результат = ТекСтрокаПремии.Премия * (НДФЛ / 100);
	КонецЦикла;

	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!


	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ


КонецПроцедуры

#КонецОбласти
