
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	НачалоПериода = НачалоМесяца(ТекущаяДатаСеанса());
	КонецПериода = КонецМесяца(ТекущаяДатаСеанса());
	
	
	Объект.КалендарьСпециалиста.ТекущиеПериодыОтображения.Добавить(НачалоПериода, КонецПериода);
	
	ОбновитьКалендарь();

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "Запись_ОбслуживаниеКлиента" Тогда
		ОбновитьКалендарь();
	КонецЕсли;	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура КалендарьСпециалистаПередСозданием(Элемент, Начало, Конец, ЗначенияИзмерений, Текст, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ЗначениеЗаполнения = Новый Структура;
	ЗначениеЗаполнения.Вставить("Дата", ОбщегоНазначенияКлиент.ДатаСеанса());
	ЗначениеЗаполнения.Вставить("ДатаПроведенияРабот", НачалоДня(Начало));
	ЗначениеЗаполнения.Вставить("ВремяНачалаРабот", Начало);
	ЗначениеЗаполнения.Вставить("ВремяОкончанияРабот", Конец);
	ЗначениеЗаполнения.Вставить("Специалист", Объект.Специалист);
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначениеЗаполнения);
	
	ОткрытьФорму("Документ.ВКМ_ОбслуживаниеКлиента.ФормаОбъекта", ПараметрыФормы);

КонецПроцедуры

&НаКлиенте
Процедура КалендарьСпециалистаПередНачаломБыстрогоРедактирования(Элемент, СтандартнаяОбработка)
	
	ОткрытьДокументОбслуживания(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура КалендарьСпециалистаПередНачаломРедактирования(Элемент, НовыйЭлемент, СтандартнаяОбработка)
	
	ОткрытьДокументОбслуживания(Элемент, СтандартнаяОбработка)
	
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Обновить(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ПериодКалендаря.ДатаНачала) Тогда

		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Заполните период перед обновлением календаря";
		Сообщение.Сообщить();
		Возврат;

	КонецЕсли;

	Если Не ЗначениеЗаполнено(Объект.Специалист) Тогда

		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Заполните поле Специалист перед обновлением календаря";
		Сообщение.Сообщить();
		Возврат;

	КонецЕсли;

	ОбновитьКалендарь();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ОбновитьКалендарь()
	
	Объект.КалендарьСпециалиста.Элементы.Очистить();
	Объект.КалендарьСпециалиста.ТекущиеПериодыОтображения.Очистить();
	
	НачалоПериода = Объект.ПериодКалендаря.ДатаНачала;
	КонецПериода = Объект.ПериодКалендаря.ДатаОкончания;

	Если Не ЗначениеЗаполнено(НачалоПериода) Тогда
		Возврат;
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(Объект.Специалист) Тогда
		Возврат;
	КонецЕсли;	
	
	Объект.КалендарьСпециалиста.ТекущиеПериодыОтображения.Добавить(НачалоПериода, КонецПериода);
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка,
		|	ВКМ_ОбслуживаниеКлиента.Дата,
		|	ВКМ_ОбслуживаниеКлиента.Специалист,
		|	ВКМ_ОбслуживаниеКлиента.ВремяНачалаРабот,
		|	ВКМ_ОбслуживаниеКлиента.ВремяОкончанияРабот
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Дата >= &ДатаНачала
		|	И ВКМ_ОбслуживаниеКлиента.Дата <= &ДатаОкончания";
	
	Запрос.УстановитьПараметр("ДатаОкончания", КонецПериода);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоПериода);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		Если Объект.Специалист = ВыборкаДетальныеЗаписи.Специалист Тогда
			ДатаНачалоДня = НачалоДня(ВыборкаДетальныеЗаписи.Дата) + Час(ВыборкаДетальныеЗаписи.ВремяНачалаРабот)* 60 
					* 60 + Минута(ВыборкаДетальныеЗаписи.ВремяНачалаРабот) * 60;
			КонецДня = (КонецДня(ВыборкаДетальныеЗаписи.Дата) + Час(ВыборкаДетальныеЗаписи.ВремяОкончанияРабот) * 60 
					* 60 + Минута(ВыборкаДетальныеЗаписи.ВремяНачалаРабот) * 60) - 86399;
			ЭлементКалендаря = Объект.КалендарьСпециалиста.Элементы.Добавить(ДатаНачалоДня, КонецДня);
			ЭлементКалендаря.Значение = ВыборкаДетальныеЗаписи.Ссылка;
			ЭлементКалендаря.Текст = СтрШаблон("Специалист: %1, Дата: %2", ВыборкаДетальныеЗаписи.Специалист,
				Формат(ВыборкаДетальныеЗаписи.Дата,"ДФ=dd.MM.yyyy"));	
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДокументОбслуживания(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Ключ", Элемент.ВыделенныеЭлементы[0].Значение);
	ОткрытьФорму("Документ.ВКМ_ОбслуживаниеКлиента.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры
#КонецОбласти
