Процедура ОбработкаПроведения(Отказ,Режим)
	

	// регистр ВКМ_КоличествоДнейОтпуска
	Движения.ВКМ_КоличествоДнейОтпуска.Записывать = Истина;
	Для Каждого ТекСтрокаОтпускаСотрудников из ОтпускаСотрудников Цикл
		Движение = Движения.ВКМ_КоличествоДнейОтпуска.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрокаОтпускаСотрудников.Сотрудник;
		Движение.КоличествоДней = ((ТекСтрокаОтпускаСотрудников.ДатаОкончания
				- ТекСтрокаОтпускаСотрудников.ДатаНачала) / 86400) + 1;	
	КонецЦикла;

	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры