#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ,Режим)
	
	// регистр ВКМ_ОсновныеНачисления
	Движения.ВКМ_ОсновныеНачисления.Записывать = Истина;
	Для Каждого ТекСтрокаОсновныеНачисления из ОсновныеНачисления Цикл
		
		Если Не ЗначениеЗаполнено(ТекСтрокаОсновныеНачисления.ПроцентОтРабот) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Просьба заполнить поле ""Процент от работ""";
			ПолеСтроки = СтрШаблон("ОсновныеНачисления[%1].ПроцентОтРабот",ТекСтрокаОсновныеНачисления.НомерСтроки - 1);
			Сообщение.Поле = ПолеСтроки;
			Сообщение.КлючДанных = Ссылка;
			Сообщение.ПутьКДанным =  "Объект";
			Сообщение.Сообщить();
			Отказ = Истина;
	
		КонецЕсли;
		
		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ТекСтрокаОсновныеНачисления.ВидРасчета;
		Движение.ПериодРегистрации = ТекСтрокаОсновныеНачисления.ДатаОкончания;
		Движение.ПериодДействияНачало = ТекСтрокаОсновныеНачисления.ДатаНачала;
		Движение.ПериодДействияКонец = ТекСтрокаОсновныеНачисления.ДатаОкончания;
		Движение.БазовыйПериодНачало = ТекСтрокаОсновныеНачисления.ДатаНачала;
		Движение.БазовыйПериодКонец = ТекСтрокаОсновныеНачисления.ДатаОкончания;
		Движение.Сотрудник = ТекСтрокаОсновныеНачисления.Сотрудник;
		Движение.Результат = ТекСтрокаОсновныеНачисления.Результат;
		Движение.ДнейОтпуска = ТекСтрокаОсновныеНачисления.ДнейОтпуска;
	
		
		УсловияОплаты = РегистрыСведений.ВКМ_УсловияОплатыСотрудников.СоздатьМенеджерЗаписи();
		УсловияОплаты.Период = ТекСтрокаОсновныеНачисления.ДатаОкончания;
		УсловияОплаты.Сотрудник = ТекСтрокаОсновныеНачисления.Сотрудник;	
		УсловияОплаты.Оклад = ТекСтрокаОсновныеНачисления.Оклад;
		УсловияОплаты.ПроцентОтРабот = ТекСтрокаОсновныеНачисления.ПроцентОтРабот;
		УсловияОплаты.Записать();
		
	КонецЦикла;
	

	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции


#КонецОбласти	
