#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Автозаполнение(Команда)
	АвтозаполнениеНаСервере();
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура АвтозаполнениеНаСервере()

	КонецПериода = КонецМесяца(Объект.Дата);

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник,
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&КонецПериода,) КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки";
	
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Объект.ВыплатаЗарплаты.Очистить();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СуммаОстаток) Тогда
			Строка = Объект.ВыплатаЗарплаты.Добавить();
			Строка.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
			Строка.Сумма = ВыборкаДетальныеЗаписи.СуммаОстаток;
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры
#КонецОбласти


