#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Автозаполнение(Команда)
	АвтозаполнениеНаСервере();
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура АвтозаполнениеНаСервере()
	
НачалоПериода = НачалоМесяца(Объект.Дата);
КонецПериода = КонецМесяца(Объект.Дата);

Запрос = Новый Запрос;
Запрос.Текст =
	"ВЫБРАТЬ
	|	ВКМ_ВзаиморасчетыССотрудникамиОстаткиИОбороты.Сотрудник КАК Сотрудник,
	|	МАКСИМУМ(ВКМ_ВзаиморасчетыССотрудникамиОстаткиИОбороты.СуммаКонечныйОстаток) КАК СуммаКонечныйОстаток,
	|	СУММА(ВКМ_Удержания.Результат) КАК Удержание,
	|	МАКСИМУМ(ВКМ_ВзаиморасчетыССотрудникамиОстаткиИОбороты.СуммаКонечныйОстаток) - СУММА(ВКМ_Удержания.Результат) КАК
	|		СуммаКВыплате
	|ИЗ
	|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Месяц,,) КАК
	|		ВКМ_ВзаиморасчетыССотрудникамиОстаткиИОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
	|		ПО ВКМ_ВзаиморасчетыССотрудникамиОстаткиИОбороты.Сотрудник = ВКМ_Удержания.Сотрудник
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_ВзаиморасчетыССотрудникамиОстаткиИОбороты.Сотрудник";

Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
Запрос.УстановитьПараметр("КонецПериода", КонецПериода);

РезультатЗапроса = Запрос.Выполнить();

ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	
	Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СуммаКВыплате) Тогда
			Объект.ВыплатаЗарплаты.Очистить();
			Строка = Объект.ВыплатаЗарплаты.Добавить();
			Строка.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
			Строка.Сумма = ВыборкаДетальныеЗаписи.СуммаКВыплате;
		КонецЕсли;
	
КонецЦикла;

КонецПроцедуры
#КонецОбласти


