#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Автозаполнение(Команда)
	АвтозаполнениеНаСервере();
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура АвтозаполнениеНаСервере()

	НачалоПериода = НачалоМесяца(Объект.Дата);
	КонецПериода = КонецМесяца(Объект.Дата);

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|ВКМ_ВзаиморасчетыССотрудникамиОстаткиИОбороты.Сотрудник КАК Сотрудник,
	|ВКМ_ВзаиморасчетыССотрудникамиОстаткиИОбороты.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
	|ВКМ_ВзаиморасчетыССотрудникамиОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
	|ВКМ_ВзаиморасчетыССотрудникамиОстаткиИОбороты.СуммаОборот КАК СуммаОборот,
	|ВКМ_ВзаиморасчетыССотрудникамиОстаткиИОбороты.СуммаПриход КАК СуммаПриход,
	|ВКМ_ВзаиморасчетыССотрудникамиОстаткиИОбороты.СуммаРасход КАК СуммаРасход
	|ИЗ
	|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , ) КАК ВКМ_ВзаиморасчетыССотрудникамиОстаткиИОбороты";
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Объект.ВыплатаЗарплаты.Очистить();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СуммаКонечныйОстаток) Тогда
			Строка = Объект.ВыплатаЗарплаты.Добавить();
			Строка.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
			Строка.Сумма = ВыборкаДетальныеЗаписи.СуммаКонечныйОстаток;
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры
#КонецОбласти


