#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АдресВХОтпусткаСотрудников") Тогда
		Адрес = Параметры.АдресВХОтпусткаСотрудников;
		ДатаДокумента = Параметры.ДатаДокумента;
	КонецЕсли;

	ТаблицаЗначений = ПолучитьИзВременногоХранилища(Адрес);
	
	СформироватьГрафикОтпусков(ТаблицаЗначений, ДатаДокумента);
	

КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура СформироватьГрафикОтпусков(ТаблицаЗначений, ДатаДокумента)

	НачалоГода = НачалоГода(ДатаДокумента);
	КонецГода = КонецГода(ДатаДокумента);

	ДиаграммаГанта.Обновление = Ложь;
	ДиаграммаГанта.Очистить();

	Серия = ДиаграммаГанта.УстановитьСерию("Отпуска");

	Для Каждого Строка Из ТаблицаЗначений Цикл

		Точка = ДиаграммаГанта.УстановитьТочку(Строка.Сотрудник);
		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
		Интервал = Значение.Добавить();
		Если Строка.ДатаНачала >= НачалоГода И Строка.ДатаОкончания <= КонецГода Тогда
			Интервал.Начало = Строка.ДатаНачала;
			Интервал.Конец = Строка.ДатаОкончания;
		КонецЕсли;

		Шкала = ДиаграммаГанта.ОбластьПостроения.ШкалаВремени.Элементы[0];
		Шкала.Метки.Очистить();


	КонецЦикла;

КонецПроцедуры
#КонецОбласти
