
#Область ОбработчикиСобытий

Функция PingGETPing(Запрос)
//	Ответ = Новый HTTPСервисОтвет(200);
//	Ответ.УстановитьТелоИзСтроки("OK");
//	Возврат Ответ;

	Возврат ВКМ_ОбщегоНазначенияHTTP.ПростойУспешныйОтвет();
КонецФункции

Функция SendPostSend(Запрос) Экспорт
//	Ответ = Новый HTTPСервисОтвет(200);
//	Возврат Ответ;
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		Ответ = ВКМ_ОбщегоНазначенияHTTP.ПростойУспешныйОтвет();
		//Ответ = ВКМ_Телеграм.ОбработатьВходящийЗапрос(Запрос);
		//Ответ = ВКМ_Телеграм.ОтправитьСообщениеБоту(Запрос);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		Ответ = ВКМ_ОбщегоНазначенияHTTP.ОтветОбОшибке(ИнформацияОбОшибке);
	КонецПопытки;
	
	ВКМ_ОбщегоНазначенияHTTP.ЗаписьЛога("send", Запрос, Ответ);
	
	Возврат Ответ;
КонецФункции

#КонецОбласти