
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура СформироватьАкты(Команда)
//	СформироватьАктыНаСервере();
	
	ИДЗадания = "";
	Индикатор = 0;
	СтрокаСостояния = "";
	
	ПараметрыЗапуска = Новый Структура;
	ПараметрыЗапуска.Вставить("ДатаДокумента", НачалоДня(Объект.Период));

	
	СтруктураФоновогоЗадания = ВыполнитьФоновоеЗаданиеНаСервере(ПараметрыЗапуска, УникальныйИдентификатор);
	ИДЗадания 	= СтруктураФоновогоЗадания.ИдентификаторЗадания;
	
	ПараметрыОжидания  = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.Интервал  = 2;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(СтруктураФоновогоЗадания, Новый ОписаниеОповещения("ОбработатьДанные", ЭтотОбъект), ПараметрыОжидания);
	
	
КонецПроцедуры




#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ВыполнитьФоновоеЗаданиеНаСервере(ПараметрыЗапуска, УникальныйИдентификатор)
	
	НаименованиеЗадания = "Сформировать акты на сервере";

	ВыполняемыйМетод = "ВКМ_АвтосозданиеИЗаполнениеРеализаций.СформироватьАктыНаСервере";
	
	ПараметрыВыполнения 	= ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	ПараметрыВыполнения.ЗапуститьВФоне 	= Истина;
	ПараметрыВыполнения.Вставить("ИдентификаторФормы", УникальныйИдентификатор); 
	
	СтруктураФоновогоЗадания = ДлительныеОперации.ВыполнитьВФоне(ВыполняемыйМетод, ПараметрыЗапуска, ПараметрыВыполнения);
	
	Возврат СтруктураФоновогоЗадания;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьДанные(Результат, ДополнительныеПараметры) Экспорт

	ОтключитьОбработчикОжидания("ОбработчикОжиданияИндикатор");
	
	Если Результат = Неопределено Тогда
		Возврат;
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
		ЭтаФорма.СтрокаСостояния = "Ошибка";
	ИначеЕсли Результат.Статус = "Выполнено" Тогда
		ЭтаФорма.Индикатор = 100;
		ЭтаФорма.СтрокаСостояния = "Выполнено";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьАктыНаСервере()

Запрос = Новый Запрос;
Запрос.Текст =
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
	|	ДоговорыКонтрагентов.Владелец,
	|	ДоговорыКонтрагентов.Организация
	|ПОМЕСТИТЬ вт_ДействующиеДоговора
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.ВКМ_НачалоДействияДоговора <= &ДатаДокумента
	|	И ДоговорыКонтрагентов.ВКМ_ОкончаниеДействияДоговора >= &ДатаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_ДействующиеДоговора.Ссылка КАК Договор,
	|	ВКМ_ВыполненныеКлиентуРаботыОбороты.Контрагент КАК Контрагент,
	|	ВКМ_ВыполненныеКлиентуРаботыОбороты.КоличествоЧасовОборот КАК КоличествоЧасовОборот,
	|	ВКМ_ВыполненныеКлиентуРаботыОбороты.СуммаКОплатеОборот КАК СуммаКОплатеОборот,
	|	ОбработкаЗаказовОбороты.СуммаОтгрузкиОборот КАК СуммаОтгрузкиОборот,
	|	вт_ДействующиеДоговора.Владелец,
	|	вт_ДействующиеДоговора.Организация
	|ИЗ
	|	вт_ДействующиеДоговора КАК вт_ДействующиеДоговора
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.Обороты(&НачалоМесяца, &КонецМесяца,,) КАК
	|			ВКМ_ВыполненныеКлиентуРаботыОбороты
	|		ПО вт_ДействующиеДоговора.Ссылка = ВКМ_ВыполненныеКлиентуРаботыОбороты.ДоговорКонтрагента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОбработкаЗаказов.Обороты(&НачалоМесяца, &КонецМесяца,,) КАК
	|			ОбработкаЗаказовОбороты
	|		ПО вт_ДействующиеДоговора.Ссылка = ОбработкаЗаказовОбороты.Договор";

	Запрос.УстановитьПараметр("ДатаДокумента", Объект.Период);
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(Объект.Период));
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(Объект.Период));

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СуммаОтгрузкиОборот) Тогда

			ОбъектРеализации = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
//			ОбъектРеализации.Дата = Объект.Период;
//			ОбъектРеализации.Контрагент = ВыборкаДетальныеЗаписи.Владелец;
//			ОбъектРеализации.Организация = ВыборкаДетальныеЗаписи.Организация;
//			ОбъектРеализации.Договор = ВыборкаДетальныеЗаписи.Договор;
//			ОбъектРеализации.Основание = ВыборкаДетальныеЗаписи.Договор;
//			ОбъектРеализации.Ответственный = Пользователи.ТекущийПользователь();
			СтруктураОбъекта = Новый Структура("Дата, Контрагент, Организация, Договор, Основание",
				Объект.Период, ВыборкаДетальныеЗаписи.Владелец, ВыборкаДетальныеЗаписи.Организация,
				ВыборкаДетальныеЗаписи.Договор, ВыборкаДетальныеЗаписи.Договор);
			ОбъектРеализации.Заполнить(СтруктураОбъекта);
			ОбъектРеализации.ВыполнитьАвтозаполнение(Объект.Период, ВыборкаДетальныеЗаписи.Договор,
				ОбъектРеализации);
			ОбъектРеализации.ВыполнитьАвтозаполнение(Объект.Период, ВыборкаДетальныеЗаписи.Договор, ОбъектРеализации);

		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
#КонецОбласти


