
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура СформироватьАкты(Команда)
	//СформироватьАктыНаСервере();
	ИДЗадания = "";
	Индикатор = 0;
	СтрокаСостояния = "";
	
	ПараметрыЗапуска = Новый Структура;
	ПараметрыЗапуска.Вставить("ДатаДокумента", НачалоДня(Объект.Период));
//	ПараметрыЗапуска.Вставить("ДатаОкон1",КонецДня(ДатаОкончания));
//	ПараметрыЗапуска.Вставить("Орг1",  Организация);
	
	СтруктураФоновогоЗадания = ВыполнитьФоновоеЗаданиеНаСервере(ПараметрыЗапуска, УникальныйИдентификатор);
	ИДЗадания 	= СтруктураФоновогоЗадания.ИдентификаторЗадания;
	
	ПараметрыОжидания  = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.Интервал  = 2;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(СтруктураФоновогоЗадания, Новый ОписаниеОповещения("ОбработатьДанные", ЭтотОбъект), ПараметрыОжидания);
	
	
КонецПроцедуры




#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ВыполнитьФоновоеЗаданиеНаСервере(ПараметрыЗапуска, УникальныйИдентификатор)
	
	НаименованиеЗадания = "Сформировать акты на сервере";

	ВыполняемыйМетод = "ВКМ_АвтосозданиеИЗаполнениеРеализаций.СформироватьАктыНаСервере";
	
	ПараметрыВыполнения 	= ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	ПараметрыВыполнения.ЗапуститьВФоне 	= Истина;
	ПараметрыВыполнения.Вставить("ИдентификаторФормы", УникальныйИдентификатор); 
	
	СтруктураФоновогоЗадания = ДлительныеОперации.ВыполнитьВФоне(ВыполняемыйМетод, ПараметрыЗапуска, ПараметрыВыполнения);
	
	Возврат СтруктураФоновогоЗадания;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьДанные(Результат, ДополнительныеПараметры) Экспорт

	ОтключитьОбработчикОжидания("ОбработчикОжиданияИндикатор");
	
	Если Результат = Неопределено Тогда
		Возврат;
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
		ЭтаФорма.СтрокаСостояния = "Ошибка";
	ИначеЕсли Результат.Статус = "Выполнено" Тогда
		ЭтаФорма.Индикатор = 100;
		ЭтаФорма.СтрокаСостояния = "Выполнено";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьАктыНаСервере()
	

Запрос = Новый Запрос;
Запрос.Текст =
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Договор,
	|	РеализацияТоваровУслуг.Ссылка КАК Реализация,
	|	ВыполненныеКлиентуРаботыОбороты.СуммаКОплатеОборот КАК СуммаКОплате,
	|	ВыполненныеКлиентуРаботыОбороты.КоличествоЧасовОборот КАК КоличествоЧасов,
	|	ДоговорыКонтрагентов.Владелец,
	|	ДоговорыКонтрагентов.Организация
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ДоговорыКонтрагентов.Ссылка = РеализацияТоваровУслуг.Договор
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыполненныеКлиентуРаботы.Обороты(&НачалоМесяца, &КонецМесяца,,) КАК
	|			ВыполненныеКлиентуРаботыОбороты
	|		ПО ДоговорыКонтрагентов.Ссылка = ВыполненныеКлиентуРаботыОбороты.ДоговорКонтрагента.Ссылка
	|ГДЕ
	|	ДоговорыКонтрагентов.ВКМ_НачалоДействияДоговора <= &ТекущаяДата
	|	И ДоговорыКонтрагентов.ВКМ_ОкончаниеДействияДоговора >= &ТекущаяДата";

Запрос.УстановитьПараметр("ТекущаяДата", Объект.Период);
Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(Объект.Период));
Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(Объект.Период));

РезультатЗапроса = Запрос.Выполнить();

ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Если ВыборкаДетальныеЗаписи.Реализация = NULL И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СуммаКОплате) Тогда
		ОбъектРеализации = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		ОбъектРеализации.Дата = Объект.Период;
		ОбъектРеализации.Контрагент = ВыборкаДетальныеЗаписи.Владелец;
		ОбъектРеализации.Организация = ВыборкаДетальныеЗаписи.Организация;
		ОбъектРеализации.Договор = ВыборкаДетальныеЗаписи.Договор;
		ОбъектРеализации.Основание = ВыборкаДетальныеЗаписи.Договор;
		ОбъектРеализации.Ответственный = Пользователи.ТекущийПользователь();
		ОбъектРеализации.ВыполнитьАвтозаполнение(Объект.Период, ВыборкаДетальныеЗаписи.Договор, ОбъектРеализации);
	
	КонецЕсли;
КонецЦикла;


КонецПроцедуры
#КонецОбласти


